package com.example.ideapad510.sherkatquestionear.Questions;


import java.util.ArrayList;

public class QuestionsAnswersArray extends ArrayList{

    public QuestionsAnswersArray() {

        this.add(new QuestionAndAnswerObject("⦁\tعملكرد كارتخوان شرکت پککو به لحاظ سرعت در برقراري ارتباط و خطوط تلفن را چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" , "1" ));
        this.add(new QuestionAndAnswerObject("⦁\tعملكرد بانک در واريز به موقع مبالغ فروش به حساب شما را چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: كاملاً ضعيف" , "  10: كاملاً خوب" , "2" ));
        this.add(new QuestionAndAnswerObject("⦁\tقابليت\u200Cهاي كارتخوان پککو (خريد، دريافت موجودي، پرداخت قبض و ...) تا چه اندازه توانسته نيازهاي شما در حوزه پرداخت الكترونيك را برطرف نمايد؟\n",
                "1: اصلاً نتوانسته" , "   10: كاملاً توانسته" , "3" ));
        this.add(new QuestionAndAnswerObject("⦁\tانجام مرتب و منظم بازرسي از كارتخوان پککو را چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" , "4" ));
        this.add(new QuestionAndAnswerObject("⦁\tتمايل و علاقهمندي كاركنان شركت و نمايندگيها و بازرسين در ارائه خدمات و پاسخگويي به نياز شما را چگونه ارزيابي ميكنيد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" , "5" ));
        this.add(new QuestionAndAnswerObject("⦁\tتمايل و علاقهمندي پرسنل شعب بانک در ارائه خدمات و پاسخگويي به نياز شما را چگونه ارزيابي ميكنيد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" , "6" ));
        this.add(new QuestionAndAnswerObject("⦁\tپاسخ به نيازها، خواستهها و مشكلات شما كه از جانب كاركنان شركت، نمايندگيها و بازرسين ارائه مي\u200Cشود تا چه اندازه مورد قبول و رضايتتان است؟\n",
                "1:اصلاً" , " 10: خيلي زياد" , "7" ));
        this.add(new QuestionAndAnswerObject("⦁\tپاسخ به نيازها، خواستهها و مشكلات شما كه از جانب پرسنل شعب بانک ارائه مي\u200Cشود تا چه اندازه مورد قبول و رضايتتان است؟\n",
                "1:اصلاً" , " 10: خيلي زياد" , "8" ));
        this.add(new QuestionAndAnswerObject("⦁\tنحوه آموزش و اطلاع رساني در خصوص استفاده و به كارگيري كارتخوان را از نظر خود و همكاران چگونه ارزيابي مينماييد؟",
                "1: خيلي ضعيف" , "  10: خيلي خوب" , "9" ));
        this.add(new QuestionAndAnswerObject("⦁\tبه طور كلي همكاري با شركت تجارت الکترونيک پارسيان تا چه اندازه توانسته است اطمينان و آرامش خاطر شما را در استفاده از دستگاههاي كارتخوان پککو فراهم نمايد؟\n",
                "1: اصلاً موفق نبوده" , " 10: كاملاً موفق بوده" , "10" ));
        this.add(new QuestionAndAnswerObject("⦁\tكاركنان و بازرسين شركت را (مثلاً در تعمير و راهاندازي كارتخوان پککو و ...)  تا چه اندازه ماهر مي\u200Cدانيد؟\n",
                "1:خيلي كم" , " 10: خيلي زياد" , "11" ));
        this.add(new QuestionAndAnswerObject("⦁\tنحوه برخورد و گفتار كاركنان شركت، نمايندگي\u200Cها و بازرسين تا چه اندازه محترمانه بوده است؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" , "12" ));
        this.add(new QuestionAndAnswerObject("⦁\tنحوه برخورد و گفتار پرسنل شعب بانک تا چه اندازه محترمانه بوده است؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" , "13" ));
        this.add(new QuestionAndAnswerObject("⦁\t طراحي و زيبايي كارتخوان پککو را در مقايسه با كارتخوان ساير بانكها چگونه ارزيابي مينماييد؟\n",
                "1: خيلي ضعيف" , "  10: خيلي خوب" , "14" ));
        this.add(new QuestionAndAnswerObject("⦁\tتجهيزات مورد استفاده\u200Cي كاركنان شركت، نمايندگي\u200Cها و بازرسين را تا اندازه زيبا و حرفه\u200Cاي مي\u200Cدانيد؟\n",
                "1: كاملاً نامناسب" , " 10: كاملاً حرفه\u200Cاي" , "15" ));
        this.add(new QuestionAndAnswerObject("تا چه ميزان پوشش ظاهري كاركنان شركت و نمايندگي\u200Cها و بازرسين را مناسب و حرفه\u200Cاي مي\u200Cدانيد؟",
                "1: اصلاً" , " 10: كاملاً حرفه\u200Cاي" , "16" ));
        this.add(new QuestionAndAnswerObject("⦁\tتا چه ميزان پوشش ظاهري پرسنل شعب بانک را مناسب و حرفه\u200Cاي مي\u200Cدانيد؟\n",
                "1: اصلاً" , " 10: كاملاً حرفه\u200Cاي" , "17" ));
        this.add(new QuestionAndAnswerObject("⦁\t تا چه ميزان  شركت براي شما به طور خاص، توجه ويژه\u200Cاي قائل شده است؟\n",
                "1: اصلاً در دسترس نيست" , " 10: كاملاً در دسترس است" , "18" ));
        this.add(new QuestionAndAnswerObject("⦁\tشركت و نمايندگيهاي آن را ( مراكز پاسخگوئي به پذيرنده) چقدر در دسترس خود احساس ميكنيد؟",
                "1: اصلاً در دسترس نيست" , "  10: كاملاً در دسترس است" , "19" ));
        this.add(new QuestionAndAnswerObject("⦁\t شركت تا چه ميزان توانسته در شما به عنوان مشتري علاقه\u200Cي قلبي نسبت به خود ايجاد نمايد؟  ",
                "1: اصلاً" , " 10: خيلي زياد" , "20" ));
        this.add(new QuestionAndAnswerObject("⦁\tدرصورتيكه تاكنون انتقاد و شكايتي نسبت به عملكرد كارتخوان پککو به صورت تلفني يا حضوري مطرح نمودهايد، كيفيت پاسخ دريافت شده و ميزان توجه به اظهارات شما چگونه بوده است؟\n",
                "1: كاملاً نامناسب" , "  10: كاملاً مناسب" , "21" ));
        this.add(new QuestionAndAnswerObject("سرعت رسيدگي به شكايات و انتقاداتي  كه از كارتخوان پککو  ارايه نمودهايد، چگونه ارزيابي مينماييد؟",
                "1: كاملاً نامناسب" , " 10: كاملاً مناسب" , "22" ));
        this.add(new QuestionAndAnswerObject("⦁\t قبل از برقراري ارتباط با شركت و استفاده از خدمات آن به طور كلي ميزان انتظارات شما از شركت در چه سطحي قرار داشت؟\n",
                "1: بسيار  پايين" , "  10: بسيار بالا" , "23" ));
        this.add(new QuestionAndAnswerObject("⦁\t قبل از برقراري ارتباط با شركت و استفاده از خدمات آن انتظارات شما از قابل اعتماد بودن خدمات ارائه شده توسط شركت در چه سطحي قرار داشت؟\n",
                "1: بسيار  پايين" , " 10: بسيار بالا" , "24" ));
        this.add(new QuestionAndAnswerObject("⦁\tبطور كلي، ميزان رضايت شما  از شركت تجارت الكترونيك پارسيان چه ميزان است؟\n",
                "1: بسيار  پايين" , " 10: بسيار بالا" , "25" ));
        this.add(new QuestionAndAnswerObject("⦁\tرضايت خود از محصولات و خدمات ارائه شده به شما در مقايسه با انتظاراتي كه از شركت داشته\u200Cايد، چگونه ارزيابي مي\u200Cكنيد؟\n",
                "1: بسيار پايين\u200Cتر از انتظارات" , " 10: فراتر از حد مورد انتظار" , "26" ));
        this.add(new QuestionAndAnswerObject("⦁\tاز محصولات و خدمات ارائه شده توسط شركت در مقايسه با ايده\u200Cآل\u200Cهاي مد نظر شما، تا چه ميزان رضايت داريد؟\n",
                "1: فاصله بسيار زياد با ايده\u200Cآل\u200Cها" , " 10:منطبق بر ايده\u200Cآل\u200Cها" , "27" ));
        this.add(new QuestionAndAnswerObject("⦁\tبه طور كلي در نظر شما اعتبار نام تجاري شركت در چه سطحي قرار دارد؟\n",
                "1: كاملاً بي اعتبار" , "  10: كاملاً معتبر" , "28" ));
        this.add(new QuestionAndAnswerObject("⦁\tاعتبار نام تجاري شركت در نظر دوستان و همكاران شما در چه سطحي است؟\n",
                "1: كاملاً بي اعتبار" , " 10: كاملاً معتبر" , "29" ));
        this.add(new QuestionAndAnswerObject("⦁\tبه نظر شما اعتبار نام تجاري شركت در مقايسه با ساير شركت\u200Cهاي فعال در اين حوزه در چه سطحي قرار دارد؟\n",
                "1: از همه بي اعتبارتر است" , " 10: از همه معتبرتر است" , "30" ));
        this.add(new QuestionAndAnswerObject("⦁\tاگر خدمات جديد و مهمي در حوزه\u200Cي كارت و كارتخوان در بازار صنعت پرداخت کشور ارائه شود،  تا چه ميزان حاضريد شرکت تجارت الکترونيک پارسيان را در اولويت اول خود براي فراهم کردن اين خدمات انتخاب کنيد؟\n",
                "1: امكان ندارد انتخاب کنم" , "  10: حتماً در اولويت اول انتخاب مي\u200Fکنم" , "31" ));
        this.add(new QuestionAndAnswerObject("⦁\tاگر كسي كه روي نظر شما حساب ويژه\u200Cاي باز مي\u200Cكند از شما در مورد استفاده از كارتخوان راهنمايي بخواهد تا چه ميزان حاضريد شركت تجارت الكترونيك پارسيان را به او پيشنهاد كنيد؟\n",
                "1: امكان ندارد پارسيان را پيشنهاد كنم" , "10: با اطمينان كامل پارسيان را پيشنهاد مي\u200Cكنم" , "32" ));
        this.add(new QuestionAndAnswerObject("⦁\tاگر يكي از دوستانتان از نداشتن كارتخوان يا خوب نبودن آن شكايت داشته باشد، با چه اطميناني حاضريد او را تشويق به استفاده از كارتخوان شركت تجارت الكترونيك پارسيان نماييد؟\n",
                "1: امكان ندارد پارسيان را معرفي كنم" , " 10: با اطمينان كامل پارسيان را معرفي مي\u200Cكنم" , "33" ));

    }

}
